{
  "architectures": ["ViTForImageClassification"],
  "attention_probs_dropout_prob": 0.0,
  "drop_path": 0.1,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "image_size": 256,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-5,
  "model_type": "vit",
  "hidden_size": [64, 128, 256, 512],
  "depths": [2, 2, 6, 2],
  "num_attention_heads": [1, 1, 4, 8],
  "num_hidden_layersA": 4,
  "num_hidden_layersB": 8,
  "intermediate_size": [512, 1024, 1024, 2048],
  "num_channels": 3,
  "patch_size": 4,
  "qkv_bias": true,
  "token_num": [3136, 784, 196, 49],

  "stain_instance_norm": true,
  "coord_conv": true,
  "attn_window": 7,
  "use_sinusoidal_pe": false,
  "token_pool": "attn",
  "topk_ratio": 0.15
}
