{
  "architectures": ["ViTForImageClassification"],
  "attention_probs_dropout_prob": 0.0,
  "drop_path": 0.1,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 384,

  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "id2label": {
    "0": "Type_1",
    "1": "Type_2",
    "2": "Type_3"
  },
  "label2id": {
    "Type_1": 0,
    "Type_2": 1,
    "Type_3": 2
  },
  "num_labels": 3,
  "layer_norm_eps": 1e-5,
  "model_type": "vit",
  "num_attention_heads": 6,
  "num_channels": 384,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "transformers_version": "4.20.1"
}
